app/views/books/_get_book_by_ppn.xml.erb

<soapenv:Envelope
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:opac="http://opac.provider.elis.unipotsdam.de/">
  <soapenv:Header/>
  <soapenv:Body>
     <opac:getBookByPPN>
        <ppn><%= ppn %></ppn>
     </opac:getBookByPPN>
  </soapenv:Body>
</soapenv:Envelope>